app/controllers/companies_controller.rb

SELECT COUNT(*) FROM "companies"
---
  def index
    @companies=Company.all