app/controllers/companys_controller.rb

SELECT COUNT(*) FROM "companies"
---
  def index
    @companys = Company.all