app/controllers/dimentions_controller.rb

INSERT INTO "dimentions" ("created_at", "title", "updated_at", "weight") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Mar 2015 08:28:24 UTC +00:00], ["title", "Dimension 1"], ["updated_at", Thu, 26 Mar 2015 08:28:24 UTC +00:00], ["weight", 5]]
---
  	def create
  		#@priority = Priority.find(params[:priority_id])

  		@dimention = Dimention.new(dimention_params)

    	if @dimention.save

SELECT "priorities".* FROM "priorities" WHERE "priorities"."id" = ? ORDER BY weight DESC LIMIT 1  [["id", "3"]]
---
	def show
		@priority = Priority.find(params[:id])