app/controllers/priorities_controller.rb

	def index
		@priorities = Priority.all
---
SELECT "priorities".* FROM "priorities" ORDER BY weight DESC

	def show
		@priority = Priority.find(params[:id])
---
SELECT "priorities".* FROM "priorities" WHERE "priorities"."id" = ? ORDER BY weight DESC LIMIT 1  [["id", "4"]]

	def create
		@priority = Priority.new(priority_params)

    	if @priority.save
---
INSERT INTO "priorities" ("created_at", "title", "updated_at", "weight") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Mar 2015 06:14:54 UTC +00:00], ["title", "Alta"], ["updated_at", Thu, 26 Mar 2015 06:14:54 UTC +00:00], ["weight", 10]]