app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "permission", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save